garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:SFRDef edc:access="--r-nnnn" edc:cname="CWG1CON1" edc:desc="" edc:impl="0x2f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--0-0000" edc:name="CWG1CON1" edc:nzwidth="0x8" edc:por="--0-0000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x697">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POLA" edc:desc="" edc:mask="0x1" edc:name="POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLB" edc:desc="" edc:mask="0x1" edc:name="POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLC" edc:desc="" edc:mask="0x1" edc:name="POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POLD" edc:desc="" edc:mask="0x1" edc:name="POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IN" edc:desc="" edc:mask="0x1" edc:name="IN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1POLA" edc:desc="" edc:mask="0x1" edc:name="CWG1POLA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLB" edc:desc="" edc:mask="0x1" edc:name="CWG1POLB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLC" edc:desc="" edc:mask="0x1" edc:name="CWG1POLC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1POLD" edc:desc="" edc:mask="0x1" edc:name="CWG1POLD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IN" edc:desc="" edc:mask="0x1" edc:name="CWG1IN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x698"/>
        <edc:SFRDef edc:access="-------n" edc:cname="CWG1CLKCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="CWG1CLKCON" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="2" edc:_begin="0x8" edc:_end="0xa" edc:_addr="0x699">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWG1CS" edc:desc="" edc:mask="0x1" edc:name="CWG1CS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CWG1ISM" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CWG1ISM" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02485_wg_cwg_v1.Module" edc:_refcount="2" edc:_begin="0x8" edc:_end="0xa" edc:_addr="0x69A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IS" edc:desc="" edc:mask="0xf" edc:name="IS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IS0" edc:desc="" edc:mask="0x1" edc:name="IS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IS1" edc:desc="" edc:mask="0x1" edc:name="IS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IS2" edc:desc="" edc:mask="0x1" edc:name="IS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IS3" edc:mask="0x1" edc:name="IS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1IS" edc:desc="" edc:mask="0xf" edc:name="CWG1IS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1IS0" edc:desc="" edc:mask="0x1" edc:name="CWG1IS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IS1" edc:desc="" edc:mask="0x1" edc:name="CWG1IS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IS2" edc:desc="" edc:mask="0x1" edc:name="CWG1IS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CWG1IS3" edc:mask="0x1" edc:name="CWG1IS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x69B"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="14" edc:beginaddr="0x700" edc:endaddr="0x720" edc:regionid="sfr14">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x700"/>
        <edc:AdjustPoint edc:offset="5" edc:_addr="0x70C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON0" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qqqqq0" edc:name="WDTCON0" edc:nzwidth="8" edc:por="--qqqqq0" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x711">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTSEN" edc:desc="" edc:mask="0x1" edc:name="WDTSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
