garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="WDTCON1" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-qqq-qqq" edc:name="WDTCON1" edc:nzwidth="8" edc:por="-qqq-qqq" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x712">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WINDOW" edc:desc="" edc:mask="0x7" edc:name="WINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS" edc:desc="" edc:mask="0x7" edc:name="WDTCS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WINDOW0" edc:desc="" edc:mask="0x1" edc:name="WINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW1" edc:desc="" edc:mask="0x1" edc:name="WINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW2" edc:desc="" edc:mask="0x1" edc:name="WINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTWINDOW" edc:desc="" edc:mask="0x7" edc:name="WDTWINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTWINDOW0" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW1" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW2" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS0" edc:desc="" edc:mask="0x1" edc:name="WDTCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS1" edc:desc="" edc:mask="0x1" edc:name="WDTCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS2" edc:desc="" edc:mask="0x1" edc:name="WDTCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x713">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xff" edc:name="PSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSCNT0" edc:desc="" edc:mask="0x1" edc:name="PSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT1" edc:desc="" edc:mask="0x1" edc:name="PSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT2" edc:desc="" edc:mask="0x1" edc:name="PSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT3" edc:desc="" edc:mask="0x1" edc:name="PSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT4" edc:desc="" edc:mask="0x1" edc:name="PSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT5" edc:desc="" edc:mask="0x1" edc:name="PSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT6" edc:desc="" edc:mask="0x1" edc:name="PSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT7" edc:desc="" edc:mask="0x1" edc:name="PSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTPSCNT" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTPSCNT0" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT1" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT2" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT3" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT4" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT5" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT6" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT7" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x714">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xff" edc:name="PSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSCNT8" edc:desc="" edc:mask="0x1" edc:name="PSCNT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT9" edc:desc="" edc:mask="0x1" edc:name="PSCNT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT10" edc:desc="" edc:mask="0x1" edc:name="PSCNT10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT11" edc:desc="" edc:mask="0x1" edc:name="PSCNT11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT12" edc:desc="" edc:mask="0x1" edc:name="PSCNT12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT13" edc:desc="" edc:mask="0x1" edc:name="PSCNT13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT14" edc:desc="" edc:mask="0x1" edc:name="PSCNT14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT15" edc:desc="" edc:mask="0x1" edc:name="PSCNT15" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTPSCNT" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTPSCNT8" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT9" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT10" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT11" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT12" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT13" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT14" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT15" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTTMR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxx000" edc:name="WDTTMR" edc:nzwidth="8" edc:por="xxxxx000" edc:_modsrc="DOS-02448_wdt_windowed_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x715">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT16" edc:desc="" edc:mask="0x1" edc:name="PSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT17" edc:desc="" edc:mask="0x1" edc:name="PSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="" edc:mask="0x1" edc:name="STATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR" edc:desc="" edc:mask="0x1f" edc:name="WDTTMR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WDTPSCNT16" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT17" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTSTATE" edc:desc="" edc:mask="0x1" edc:name="WDTSTATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR0" edc:desc="" edc:mask="0x1" edc:name="WDTTMR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR1" edc:desc="" edc:mask="0x1" edc:name="WDTTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR2" edc:desc="" edc:mask="0x1" edc:name="WDTTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR3" edc:desc="" edc:mask="0x1" edc:name="WDTTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR4" edc:desc="" edc:mask="0x1" edc:name="WDTTMR4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0x716"/>
        <edc:JoinedSFRDef edc:cname="SCANLADR" edc:desc="" edc:name="SCANLADR" edc:nzwidth="0x10" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x718">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x718">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:desc="" edc:mask="0xff" edc:name="LADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LDAR0" edc:desc="" edc:mask="0x1" edc:name="LDAR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LDAR1" edc:desc="" edc:mask="0x1" edc:name="LDAR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR2" edc:desc="" edc:mask="0x1" edc:name="LADR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR3" edc:desc="" edc:mask="0x1" edc:name="LADR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR4" edc:desc="" edc:mask="0x1" edc:name="LADR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR5" edc:desc="" edc:mask="0x1" edc:name="LADR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR6" edc:desc="" edc:mask="0x1" edc:name="LADR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR7" edc:desc="" edc:mask="0x1" edc:name="LADR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:desc="" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR0" edc:desc="" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR1" edc:desc="" edc:mask="0x1" edc:name="SCANLADR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR2" edc:desc="" edc:mask="0x1" edc:name="SCANLADR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR3" edc:desc="" edc:mask="0x1" edc:name="SCANLADR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR4" edc:desc="" edc:mask="0x1" edc:name="SCANLADR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR5" edc:desc="" edc:mask="0x1" edc:name="SCANLADR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR6" edc:desc="" edc:mask="0x1" edc:name="SCANLADR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR7" edc:desc="" edc:mask="0x1" edc:name="SCANLADR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x719">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:desc="" edc:mask="0xff" edc:name="LADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR8" edc:desc="" edc:mask="0x1" edc:name="LADR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR9" edc:desc="" edc:mask="0x1" edc:name="LADR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR10" edc:desc="" edc:mask="0x1" edc:name="LADR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR11" edc:desc="" edc:mask="0x1" edc:name="LADR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR12" edc:desc="" edc:mask="0x1" edc:name="LADR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR13" edc:desc="" edc:mask="0x1" edc:name="LADR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR14" edc:desc="" edc:mask="0x1" edc:name="LADR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="LADR15" edc:desc="" edc:mask="0x1" edc:name="LADR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:desc="" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR8" edc:desc="" edc:mask="0x1" edc:name="SCANLADR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR9" edc:desc="" edc:mask="0x1" edc:name="SCANLADR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR10" edc:desc="" edc:mask="0x1" edc:name="SCANLADR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR11" edc:desc="" edc:mask="0x1" edc:name="SCANLADR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR12" edc:desc="" edc:mask="0x1" edc:name="SCANLADR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR13" edc:desc="" edc:mask="0x1" edc:name="SCANLADR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR14" edc:desc="" edc:mask="0x1" edc:name="SCANLADR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR15" edc:desc="" edc:mask="0x1" edc:name="SCANLADR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SCANHADR" edc:desc="" edc:name="SCANHADR" edc:nzwidth="0x10" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x71A">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x71A">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:desc="" edc:mask="0xff" edc:name="HADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR0" edc:desc="" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR1" edc:desc="" edc:mask="0x1" edc:name="HADR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HARD2" edc:desc="" edc:mask="0x1" edc:name="HARD2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR3" edc:desc="" edc:mask="0x1" edc:name="HADR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR4" edc:desc="" edc:mask="0x1" edc:name="HADR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR5" edc:desc="" edc:mask="0x1" edc:name="HADR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR6" edc:desc="" edc:mask="0x1" edc:name="HADR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR7" edc:desc="" edc:mask="0x1" edc:name="HADR7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:desc="" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR0" edc:desc="" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR1" edc:desc="" edc:mask="0x1" edc:name="SCANHADR1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR2" edc:desc="" edc:mask="0x1" edc:name="SCANHADR2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR3" edc:desc="" edc:mask="0x1" edc:name="SCANHADR3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR4" edc:desc="" edc:mask="0x1" edc:name="SCANHADR4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR5" edc:desc="" edc:mask="0x1" edc:name="SCANHADR5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR6" edc:desc="" edc:mask="0x1" edc:name="SCANHADR6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR7" edc:desc="" edc:mask="0x1" edc:name="SCANHADR7" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRH" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02454_dma_nvm_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x71B">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:desc="" edc:mask="0xff" edc:name="HADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR8" edc:desc="" edc:mask="0x1" edc:name="HADR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR9" edc:desc="" edc:mask="0x1" edc:name="HADR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR10" edc:desc="" edc:mask="0x1" edc:name="HADR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR11" edc:desc="" edc:mask="0x1" edc:name="HADR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR12" edc:desc="" edc:mask="0x1" edc:name="HADR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR13" edc:desc="" edc:mask="0x1" edc:name="HADR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR14" edc:desc="" edc:mask="0x1" edc:name="HADR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HADR15" edc:desc="" edc:mask="0x1" edc:name="HADR15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:desc="" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR8" edc:desc="" edc:mask="0x1" edc:name="SCANHADR8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR9" edc:desc="" edc:mask="0x1" edc:name="SCANHADR9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR10" edc:desc="" edc:mask="0x1" edc:name="SCANHADR10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR11" edc:desc="" edc:mask="0x1" edc:name="SCANHADR11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR12" edc:desc="" edc:mask="0x1" edc:name="SCANHADR12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR13" edc:desc="" edc:mask="0x1" edc:name="SCANHADR13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR14" edc:desc="" edc:mask="0x1" edc:name="SCANHADR14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR15" edc:desc="" edc:mask="0x1" edc:name="SCANHADR15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
