garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:JoinedSFRDef edc:cname="CRCSHIFT" edc:desc="" edc:name="CRCSHIFT" edc:nzwidth="0x10" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x795">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCSHIFTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x795">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="SHIFT0" edc:mask="0x1" edc:name="SHIFT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT1" edc:mask="0x1" edc:name="SHIFT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT2" edc:mask="0x1" edc:name="SHIFT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT3" edc:mask="0x1" edc:name="SHIFT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT4" edc:mask="0x1" edc:name="SHIFT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT5" edc:mask="0x1" edc:name="SHIFT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT6" edc:mask="0x1" edc:name="SHIFT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT7" edc:mask="0x1" edc:name="SHIFT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCSHIFT" edc:mask="0xff" edc:name="CRCSHIFT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCSHIFT0" edc:mask="0x1" edc:name="CRCSHIFT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT1" edc:mask="0x1" edc:name="CRCSHIFT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT2" edc:mask="0x1" edc:name="CRCSHIFT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT3" edc:mask="0x1" edc:name="CRCSHIFT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT4" edc:mask="0x1" edc:name="CRCSHIFT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT5" edc:mask="0x1" edc:name="CRCSHIFT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT6" edc:mask="0x1" edc:name="CRCSHIFT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT7" edc:mask="0x1" edc:name="CRCSHIFT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCSHIFTH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCSHIFTH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x796">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SHIFT" edc:mask="0xff" edc:name="SHIFT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.1">
                <edc:SFRFieldDef edc:cname="SHIFT8" edc:mask="0x1" edc:name="SHIFT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT9" edc:mask="0x1" edc:name="SHIFT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT10" edc:mask="0x1" edc:name="SHIFT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT11" edc:mask="0x1" edc:name="SHIFT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT12" edc:mask="0x1" edc:name="SHIFT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT13" edc:mask="0x1" edc:name="SHIFT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT14" edc:mask="0x1" edc:name="SHIFT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SHIFT15" edc:mask="0x1" edc:name="SHIFT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCSHIFT" edc:mask="0xff" edc:name="CRCSHIFT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="CRCSHIFT8" edc:mask="0x1" edc:name="CRCSHIFT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT9" edc:mask="0x1" edc:name="CRCSHIFT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT10" edc:mask="0x1" edc:name="CRCSHIFT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT11" edc:mask="0x1" edc:name="CRCSHIFT11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT12" edc:mask="0x1" edc:name="CRCSHIFT12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT13" edc:mask="0x1" edc:name="CRCSHIFT13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT14" edc:mask="0x1" edc:name="CRCSHIFT14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCSHIFT15" edc:mask="0x1" edc:name="CRCSHIFT15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="CRCXOR" edc:desc="" edc:name="CRCXOR" edc:nzwidth="0x10" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x797">
          <edc:SFRDef edc:access="nnnnnnn-" edc:cname="CRCXORL" edc:desc="" edc:impl="0xfe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxx-" edc:name="CRCXORL" edc:nzwidth="8" edc:por="xxxxxxx-" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x797">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR1" edc:mask="0x1" edc:name="XOR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR2" edc:mask="0x1" edc:name="XOR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR3" edc:mask="0x1" edc:name="XOR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR4" edc:mask="0x1" edc:name="XOR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR5" edc:mask="0x1" edc:name="XOR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR6" edc:mask="0x1" edc:name="XOR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR7" edc:mask="0x1" edc:name="XOR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:AdjustPoint edc:offset="1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR1" edc:mask="0x1" edc:name="CRCXOR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR2" edc:mask="0x1" edc:name="CRCXOR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR3" edc:mask="0x1" edc:name="CRCXOR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR4" edc:mask="0x1" edc:name="CRCXOR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR5" edc:mask="0x1" edc:name="CRCXOR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR6" edc:mask="0x1" edc:name="CRCXOR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR7" edc:mask="0x1" edc:name="CRCXOR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="CRCXORH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x798">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="XOR8" edc:mask="0x1" edc:name="XOR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR9" edc:mask="0x1" edc:name="XOR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR10" edc:mask="0x1" edc:name="XOR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR11" edc:mask="0x1" edc:name="XOR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR12" edc:mask="0x1" edc:name="XOR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR13" edc:mask="0x1" edc:name="XOR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR14" edc:mask="0x1" edc:name="XOR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="XOR15" edc:mask="0x1" edc:name="XOR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="CRCXOR8" edc:mask="0x1" edc:name="CRCXOR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR9" edc:mask="0x1" edc:name="CRCXOR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR10" edc:mask="0x1" edc:name="CRCXOR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR11" edc:mask="0x1" edc:name="CRCXOR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR12" edc:mask="0x1" edc:name="CRCXOR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR13" edc:mask="0x1" edc:name="CRCXOR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR14" edc:mask="0x1" edc:name="CRCXOR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="CRCXOR15" edc:mask="0x1" edc:name="CRCXOR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrn--nr" edc:cname="CRCCON0" edc:desc="" edc:impl="0xf3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--00" edc:name="CRCCON0" edc:nzwidth="8" edc:por="0000--00" edc:_modsrc="DOS-02421_math_progcrc_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x799">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FULL" edc:desc="" edc:mask="0x1" edc:name="FULL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHIFTM" edc:desc="" edc:mask="0x1" edc:name="SHIFTM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ACCM" edc:desc="" edc:mask="0x1" edc:name="ACCM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CRCFULL" edc:desc="" edc:mask="0x1" edc:name="CRCFULL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCSHIFTM" edc:desc="" edc:mask="0x1" edc:name="CRCSHIFTM" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CRCACCM" edc:desc="" edc:mask="0x1" edc:name="CRCACCM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCBUSY" edc:desc="" edc:mask="0x1" edc:name="CRCBUSY" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
