garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:SFRDef edc:access="n--nn--n" edc:cname="AT1CCON1" edc:desc="" edc:impl="0x99" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00--0" edc:name="AT1CCON1" edc:nzwidth="8" edc:por="0--00--0" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x891">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CC1MODE" edc:desc="" edc:mask="0x1" edc:name="AT1CC1MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AT1CAP1P" edc:desc="" edc:mask="0x1" edc:name="AT1CAP1P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC1POL" edc:desc="" edc:mask="0x1" edc:name="AT1CC1POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC1EN" edc:desc="" edc:mask="0x1" edc:name="AT1CC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CC1MODE" edc:desc="" edc:mask="0x1" edc:name="CC1MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CAP1P" edc:desc="" edc:mask="0x1" edc:name="CAP1P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CC1POL" edc:desc="" edc:mask="0x1" edc:name="CC1POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CC1EN" edc:desc="" edc:mask="0x1" edc:name="CC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="AT1CSEL2" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="AT1CSEL2" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x892">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CP2S" edc:desc="" edc:mask="0x7" edc:name="AT1CP2S" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AT1CP2S0" edc:desc="" edc:mask="0x1" edc:name="AT1CP2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP2S1" edc:desc="" edc:mask="0x1" edc:name="AT1CP2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CP2S2" edc:desc="" edc:mask="0x1" edc:name="AT1CP2S2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CP2S" edc:desc="" edc:mask="0x7" edc:name="CP2S" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CP2S0" edc:desc="" edc:mask="0x1" edc:name="CP2S0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP2S1" edc:desc="" edc:mask="0x1" edc:name="CP2S1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CP2S2" edc:desc="" edc:mask="0x1" edc:name="CP2S2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="AT1CC2" edc:desc="" edc:name="AT1CC2" edc:nzwidth="0x10" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x893">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AT1CC2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="AT1CC2L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x893">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC20" edc:desc="" edc:mask="0x1" edc:name="AT1CC20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC21" edc:desc="" edc:mask="0x1" edc:name="AT1CC21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC22" edc:desc="" edc:mask="0x1" edc:name="AT1CC22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC23" edc:desc="" edc:mask="0x1" edc:name="AT1CC23" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC24" edc:desc="" edc:mask="0x1" edc:name="AT1CC24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC25" edc:desc="" edc:mask="0x1" edc:name="AT1CC25" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC26" edc:desc="" edc:mask="0x1" edc:name="AT1CC26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC27" edc:desc="" edc:mask="0x1" edc:name="AT1CC27" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC20" edc:desc="" edc:mask="0x1" edc:name="CC20" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC21" edc:desc="" edc:mask="0x1" edc:name="CC21" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC22" edc:desc="" edc:mask="0x1" edc:name="CC22" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC13" edc:desc="" edc:mask="0x1" edc:name="CC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC24" edc:desc="" edc:mask="0x1" edc:name="CC24" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CCW5" edc:desc="" edc:mask="0x1" edc:name="CCW5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC26" edc:desc="" edc:mask="0x1" edc:name="CC26" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC27" edc:desc="" edc:mask="0x1" edc:name="CC27" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="AT1CC2H" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="AT1CC2H" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x894">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="AT1CC28" edc:desc="" edc:mask="0x1" edc:name="AT1CC28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="AT1CC29" edc:desc="" edc:mask="0x1" edc:name="AT1CC29" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="CC28" edc:desc="" edc:mask="0x1" edc:name="CC28" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="CC29" edc:desc="" edc:mask="0x1" edc:name="CC29" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n--nn--n" edc:cname="AT1CCON2" edc:desc="" edc:impl="0x99" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0--00--0" edc:name="AT1CCON2" edc:nzwidth="8" edc:por="0--00--0" edc:_modsrc="DOS-02644_tmr_angular_v1.Module" edc:_refcount="3" edc:_begin="0x12" edc:_end="0x20" edc:_addr="0x895">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AT1CC2MODE" edc:desc="" edc:mask="0x1" edc:name="AT1CC2MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="AT1CAP2P" edc:desc="" edc:mask="0x1" edc:name="AT1CAP2P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC2POL" edc:desc="" edc:mask="0x1" edc:name="AT1CC2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AT1CC2EN" edc:desc="" edc:mask="0x1" edc:name="AT1CC2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CC2MODE" edc:desc="" edc:mask="0x1" edc:name="CC2MODE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CAP2P" edc:desc="" edc:mask="0x1" edc:name="CAP2P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CC2POL" edc:desc="" edc:mask="0x1" edc:name="CC2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CC2EN" edc:desc="" edc:mask="0x1" edc:name="CC2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
