garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5GPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T5GPPS" edc:mask="0x1f" edc:name="T5GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GPPS0" edc:desc="" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS1" edc:desc="" edc:mask="0x1" edc:name="T5GPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS2" edc:desc="" edc:mask="0x1" edc:name="T5GPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS3" edc:desc="" edc:mask="0x1" edc:name="T5GPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS4" edc:desc="" edc:mask="0x1" edc:name="T5GPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T6CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T6CKIPPS" edc:nzwidth="8" edc:por="---00011" edc:_addr="0xE1E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T6PPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKIPPS" edc:mask="0x1f" edc:name="T6CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T6CKIPPS0" edc:mask="0x1" edc:name="T6CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS1" edc:mask="0x1" edc:name="T6CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS2" edc:mask="0x1" edc:name="T6CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS3" edc:mask="0x1" edc:name="T6CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T6CKIPPS4" edc:mask="0x1" edc:name="T6CKIPPS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T6PPS" edc:mask="0x1f" edc:name="T6PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6PPS0" edc:desc="" edc:mask="0x1" edc:name="T6PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS1" edc:desc="" edc:mask="0x1" edc:name="T6PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS2" edc:desc="" edc:mask="0x1" edc:name="T6PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS3" edc:desc="" edc:mask="0x1" edc:name="T6PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6PPS4" edc:desc="" edc:mask="0x1" edc:name="T6PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATCC1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATCC1PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATCC1PPS" edc:mask="0x1f" edc:name="ATCC1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATCC1PPS0" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS1" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS2" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS3" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC1PPS4" edc:desc="" edc:mask="0x1" edc:name="ATCC1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPCLKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPCLKPPS" edc:nzwidth="8" edc:por="---01110" edc:_addr="0xE20">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS" edc:mask="0x1f" edc:name="SSPCLKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPCLKPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPCLKPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPCLKPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPDATPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPDATPPS" edc:nzwidth="8" edc:por="---01100" edc:_addr="0xE21">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS" edc:mask="0x1f" edc:name="SSPDATPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPDATPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPDATPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPDATPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SSPSSPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SSPSSPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE22">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS" edc:mask="0x1f" edc:name="SSPSSPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPSSPPS0" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS1" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS2" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS3" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPSSPPS4" edc:desc="" edc:mask="0x1" edc:name="SSPSSPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="ATCC2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="ATCC2PPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE23">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ATCC2PPS" edc:mask="0x1f" edc:name="ATCC2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ATCC2PPS0" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS1" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS2" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS3" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ATCC2PPS4" edc:desc="" edc:mask="0x1" edc:name="ATCC2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
