garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1619.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RXPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RXPPS" edc:nzwidth="8" edc:por="---01101" edc:_addr="0xE24">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXPPS" edc:mask="0x1f" edc:name="RXPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXPPS0" edc:desc="" edc:mask="0x1" edc:name="RXPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS1" edc:desc="" edc:mask="0x1" edc:name="RXPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS2" edc:desc="" edc:mask="0x1" edc:name="RXPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS3" edc:desc="" edc:mask="0x1" edc:name="RXPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXPPS4" edc:desc="" edc:mask="0x1" edc:name="RXPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CKPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CKPPS" edc:nzwidth="8" edc:por="---01111" edc:_addr="0xE25">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKPPS" edc:mask="0x1f" edc:name="CKPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CKPPS0" edc:desc="" edc:mask="0x1" edc:name="CKPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS1" edc:desc="" edc:mask="0x1" edc:name="CKPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS2" edc:desc="" edc:mask="0x1" edc:name="CKPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS3" edc:desc="" edc:mask="0x1" edc:name="CKPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPPS4" edc:desc="" edc:mask="0x1" edc:name="CKPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1SIGPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT1SIGPPS" edc:nzwidth="8" edc:por="---00100" edc:_addr="0xE26">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS" edc:mask="0x1f" edc:name="SMT1SIGPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS0" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS1" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS2" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS3" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMT1SIGPPS4" edc:desc="" edc:mask="0x1" edc:name="SMT1SIGPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SMT1WINPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="SMT1WINPPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE27">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SMT1WINPPS" edc:mask="0x1f" edc:name="SMT1WINPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SMTWINPPS0" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS1" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS2" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS3" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMTWINPPS4" edc:desc="" edc:mask="0x1" edc:name="SMTWINPPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xE28">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCN0PPS" edc:mask="0x1f" edc:name="CLCN0PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="---10100" edc:_addr="0xE29">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x1f" edc:name="CLCIN1PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="---10001" edc:_addr="0xE2A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x1f" edc:name="CLCIN2PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="---00101" edc:_addr="0xE2B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x1f" edc:name="CLCIN3PPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:desc="" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
